
    create sequence team_SEQ start with 1 increment by 50;

    create table team (
        id integer not null,
        is_active boolean default true not null,
        created_at timestamp DEFAULT CURRENT_TIMESTAMP not null,
        updated_at timestamp DEFAULT CURRENT_TIMESTAMP not null,
        name varchar(64) not null unique,
        primary key (id)
    );
insert into public.team (id, is_active, created_at, updated_at, name) values  (1, true, '2023-09-03 23:26:34.000000', '2023-09-03 23:26:41.000000', '阪神タイガース'),         (2, true, '2023-09-03 14:28:12.868750', '2023-09-03 14:28:12.868750', '広島カープ'),         (3, true, '2023-09-03 14:28:12.868750', '2023-09-03 14:28:12.868750', '横浜DeNAベイスターズ'),         (4, true, '2023-09-03 14:28:12.868750', '2023-09-03 14:28:12.868750', '読売ジャイアンツ'),         (5, true, '2023-09-03 14:28:12.868750', '2023-09-03 14:28:12.868750', '東京ヤクルトスワローズ'),         (6, true, '2023-09-03 14:28:12.868750', '2023-09-03 14:28:12.868750', '中日ドラゴンズ'),         (7, true, '2023-09-03 14:32:51.941390', '2023-09-03 14:32:51.941390', 'オリックス・バファローズ'),         (8, true, '2023-09-03 14:32:51.941390', '2023-09-03 14:32:51.941390', '千葉ロッテマリーンズ'),         (9, true, '2023-09-03 14:32:51.941390', '2023-09-03 14:32:51.941390', '福岡ソフトバンクホークス'),         (10, true, '2023-09-03 14:32:51.941390', '2023-09-03 14:32:51.941390', '楽天イーグルス'),         (11, true, '2023-09-03 14:32:51.941390', '2023-09-03 14:32:51.941390', '北海道日本ハムファイターズ'),         (12, true, '2023-09-03 14:32:51.941390', '2023-09-03 14:32:51.941390', '埼玉西武ライオンズ');
